Services/b2bcliente/request_template.xml

<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:b2b="http://www.enl.com.mx/B2BFactura/">
   <soapenv:Header/>
   <soapenv:Body>
      <b2b:consultarFactura>
         <Empresa>RICOH</Empresa>
         <Periodo>Hoy</Periodo>
         <FechaEmisionInicio></FechaEmisionInicio>
         <FechaEmisionFin></FechaEmisionFin>
         <Status></Status>
         <NumeroFactura></NumeroFactura>
         <Factura>Factura</Factura>
         <Cuenta></Cuenta>
         <Cuenta></Cuenta>
         <Prefijo></Prefijo>
         <FolioInicio></FolioInicio>
         <FolioFin></FolioFin>
         <Acuse>Aceptado</Acuse>
         <NITAdquiriente></NITAdquiriente>
      </b2b:consultarFactura>
   </soapenv:Body>
</soapenv:Envelope> 
